templates/2.1.x/Base/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "$FOAM_CASE/simpleSetup.in"

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform $initialVelocity;

boundaryField
{
    ".*"
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    "(.*[Oo]utlet.*|.*[Aa]tmospher.*)"
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    "(.*[Oo]pening.*|.*[Aa]mbien.*)"
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

#   include "include/inlet.in"
#   includeIfPresent "include/freeStream.in"
#   include "include/general.in"

}


// ************************************************************************* //
