templates/2.1.x/Base/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "$FOAM_CASE/simpleSetup.in"

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    ".*"
    {
        type            zeroGradient;
    }
    "(.*[Oo]utlet.*|.*[Aa]tmospher.*)"
    {
        type            fixedValue;
        value           uniform 0;
    }
    "(.*[Oo]pening.*|.*[Aa]mbien.*)"
    {
        type            totalPressure;
        U               U;
        phi             phi;
        rho             none;
        psi             none;
        gamma           1;
        p0              uniform 0;
    }

#   includeIfPresent    "include/freeStream.in"
#   include             "include/general.in"

}


// ************************************************************************* //
