templates/2.1.x/Base/0/include/general.in
    "procBoundary.*"
    {
        type            processor;
        value           $internalField;
    }
    "(.*[Ii]nterface.*|.*AMI.*)"
    {
        type            cyclicAMI;
        value           $internalField;
    }
    ".*[Ss]lip.*"
    {
        type            slip;
    }
    ".*[Ss]ymmetry.*"
    {
        type            symmetryPlane;
    }
    frontAndBack
    {
        type            empty;
    }
