templates/2.1.x/Base/0/include/inlet.in
    ".*[Ii]nlet.*"
    {
        type            fixedValue;
        value           uniform $initialVelocity;
    }
