templates/2.1.x/Base/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// * * * Scheme macro section  * * * * * * * * * * * * * * * * * * * * * * * //

/* Laplacian */
Correction                  limited 0.33; // corrected;
LaplacianScheme             Gauss linear $Correction;

// * * * End scheme macro section  * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         Gauss linear;
    grad(p)         Gauss linear;
    gradLimiter     cellLimited Gauss linear 1;
    grad(U)         cellLimited Gauss linear 1;
}

divSchemes
{
    default             Gauss linearUpwind gradLimiter;
    div(phi,U)          Gauss linearUpwindV grad(U);
    div(phi,R)          Gauss limitedLinear 1;
    div(R)              Gauss linear;
    div((nuEff*dev(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default                 $LaplacianScheme;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         $Correction;
}

fluxRequired
{
    default         no;
    p               ;
}


// ************************************************************************* //
