templates/2.1.x/Base/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "${FOAM_CASE}/system/include/solvers"

solvers
{
    p
    {
        $gamg;
    }

    pFinal
    {
        $p;
        relTol 0;
    }

    U
    {
        $smoothSolver;
    }

    UFinal
    {
        $U;
        relTol 0;
    }

    "(k|epsilon|omega)"
    {
        $smoothSolver;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 1;
    pRefCell        0;
    pRefValue       0;

    residualControl
    {
        p               1e-3;
        U               1e-4;
        "(k|epsilon|omega)" 1e-3;
    }

}

potentialFlow
{
    nNonOrthogonalCorrectors 10;
}

PISO
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 2;
    pRefCell        0;
    pRefValue       0;
}

PIMPLE
{
    nOuterCorrectors 2;
    nCorrectors     2;
    nNonOrthogonalCorrectors 1;
    pRefCell        0;
    pRefValue       0;
}

relaxationFactors
{
    fields
    {
    };
    equations
    {
        p               0.3;
        U               0.7;
        k               0.3;
        epsilon         0.3;
        omega           0.3;
    }
}


// ************************************************************************* //
