templates/2.1.x/Base/system/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dictionaryReplacement
{

boundary
{
    "(.*[Ww]all.*|.*[Ss]lip.*)"
    {
        type            wall;
    }
    "(.*[Ii]nlet.*|.*[Ff]ree[Ss]tream.*)"
    {
        type            patch;

    }
    ".*[Oo]utlet.*"
    {
        type            patch;
    }
    ".*[Oo]pening.*"
    {
        type            patch;
    }
    ".*[Ss]ymmetry.*"
    {
        type            symmetryPlane;
    }
    ".*frontAndBack.*"
    {
        type            empty;
    }
}

}


// ************************************************************************* //
